In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## Reading Data and explorinf columns, values, type of values, etc

In [2]:
data = pd.read_csv('./Placement_Data_Full_Class.csv')
data.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [4]:
object_col = list(data.select_dtypes('object'))

In [5]:
for cols in object_col:
    print('-'*40 + cols + '-'*40, end='\n')
    print(data[cols].value_counts())

----------------------------------------gender----------------------------------------
M    139
F     76
Name: gender, dtype: int64
----------------------------------------ssc_b----------------------------------------
Central    116
Others      99
Name: ssc_b, dtype: int64
----------------------------------------hsc_b----------------------------------------
Others     131
Central     84
Name: hsc_b, dtype: int64
----------------------------------------hsc_s----------------------------------------
Commerce    113
Science      91
Arts         11
Name: hsc_s, dtype: int64
----------------------------------------degree_t----------------------------------------
Comm&Mgmt    145
Sci&Tech      59
Others        11
Name: degree_t, dtype: int64
----------------------------------------workex----------------------------------------
No     141
Yes     74
Name: workex, dtype: int64
----------------------------------------specialisation----------------------------------------
Mkt&Fin    120
Mkt&HR      95
Name: specialisation, dtype: int64
----------------------------------------status----------------------------------------
Placed        148
Not Placed     67
Name: status, dtype: int64

In [6]:
data.shape

(215, 15)

In [7]:
x = data.loc[data['status']=='Not Placed']

In [8]:
x['salary'].isna().sum()

67

### We see people, who arent placed, their salary is 0 in data set. Hence Data set is correct and can be used without any issues. Only we'll be needing to convert Object to Numerical data